IDEA Open Model
ResultOnMesh Class
Compatible with IDEA StatiCa Beta 20.0
[Missing <summary> documentation for "T:IdeaRS.OpenModel.Result.ResultOnMesh"]
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOnMesh
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class ResultOnMesh
<SerializableAttribute>
Public Class ResultOnMesh
The ResultOnMesh type exposes the following members.
Constructors
Name | Description
ResultOnMesh
Initializes a new instance of the ResultOnMesh class
Top
Properties
Name | Description
Displacement
Nodes
PlatesElement
 List of elements for each plate UID
Value
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace